Revit 2027 API
DirectContext3DHandleOverrides.IsEqual Method
 Check if the contents of two overrides are equal.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEqual(
	DirectContext3DHandleOverrides other
)
Public Function IsEqual (
	other As DirectContext3DHandleOverrides
) As Boolean
public:
bool IsEqual(
	DirectContext3DHandleOverrides^ other
)
member IsEqual :
        other : DirectContext3DHandleOverrides -> bool
Parameters
other DirectContext3DHandleOverrides
 The overrides to be compared.
Return Value
Boolean
 True for equal, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectContext3DHandleOverrides Class
Autodesk.Revit.DB.DirectContext3D Namespace